reference/openfoam/compressible_acoustic_box/system/probes.cfg
type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

fields (U p T);

// Probe points at structured-cell centers along the x-centerline:
//   y = 0.025 (Ny=1, H=0.05)
//   x = dx/2 .. L - dx/2 with Nx=200, dx=0.005
probeLocations
(
    (0.0025 0.025 0)
    (0.0075 0.025 0)
    (0.0125 0.025 0)
    (0.0175 0.025 0)
    (0.0225 0.025 0)
    (0.0275 0.025 0)
    (0.0325 0.025 0)
    (0.0375 0.025 0)
    (0.0425 0.025 0)
    (0.0475 0.025 0)
    (0.0525 0.025 0)
    (0.0575 0.025 0)
    (0.0625 0.025 0)
    (0.0675 0.025 0)
    (0.0725 0.025 0)
    (0.0775 0.025 0)
    (0.0825 0.025 0)
    (0.0875 0.025 0)
    (0.0925 0.025 0)
    (0.0975 0.025 0)
    (0.1025 0.025 0)
    (0.1075 0.025 0)
    (0.1125 0.025 0)
    (0.1175 0.025 0)
    (0.1225 0.025 0)
    (0.1275 0.025 0)
    (0.1325 0.025 0)
    (0.1375 0.025 0)
    (0.1425 0.025 0)
    (0.1475 0.025 0)
    (0.1525 0.025 0)
    (0.1575 0.025 0)
    (0.1625 0.025 0)
    (0.1675 0.025 0)
    (0.1725 0.025 0)
    (0.1775 0.025 0)
    (0.1825 0.025 0)
    (0.1875 0.025 0)
    (0.1925 0.025 0)
    (0.1975 0.025 0)
    (0.2025 0.025 0)
    (0.2075 0.025 0)
    (0.2125 0.025 0)
    (0.2175 0.025 0)
    (0.2225 0.025 0)
    (0.2275 0.025 0)
    (0.2325 0.025 0)
    (0.2375 0.025 0)
    (0.2425 0.025 0)
    (0.2475 0.025 0)
    (0.2525 0.025 0)
    (0.2575 0.025 0)
    (0.2625 0.025 0)
    (0.2675 0.025 0)
    (0.2725 0.025 0)
    (0.2775 0.025 0)
    (0.2825 0.025 0)
    (0.2875 0.025 0)
    (0.2925 0.025 0)
    (0.2975 0.025 0)
    (0.3025 0.025 0)
    (0.3075 0.025 0)
    (0.3125 0.025 0)
    (0.3175 0.025 0)
    (0.3225 0.025 0)
    (0.3275 0.025 0)
    (0.3325 0.025 0)
    (0.3375 0.025 0)
    (0.3425 0.025 0)
    (0.3475 0.025 0)
    (0.3525 0.025 0)
    (0.3575 0.025 0)
    (0.3625 0.025 0)
    (0.3675 0.025 0)
    (0.3725 0.025 0)
    (0.3775 0.025 0)
    (0.3825 0.025 0)
    (0.3875 0.025 0)
    (0.3925 0.025 0)
    (0.3975 0.025 0)
    (0.4025 0.025 0)
    (0.4075 0.025 0)
    (0.4125 0.025 0)
    (0.4175 0.025 0)
    (0.4225 0.025 0)
    (0.4275 0.025 0)
    (0.4325 0.025 0)
    (0.4375 0.025 0)
    (0.4425 0.025 0)
    (0.4475 0.025 0)
    (0.4525 0.025 0)
    (0.4575 0.025 0)
    (0.4625 0.025 0)
    (0.4675 0.025 0)
    (0.4725 0.025 0)
    (0.4775 0.025 0)
    (0.4825 0.025 0)
    (0.4875 0.025 0)
    (0.4925 0.025 0)
    (0.4975 0.025 0)
    (0.5025 0.025 0)
    (0.5075 0.025 0)
    (0.5125 0.025 0)
    (0.5175 0.025 0)
    (0.5225 0.025 0)
    (0.5275 0.025 0)
    (0.5325 0.025 0)
    (0.5375 0.025 0)
    (0.5425 0.025 0)
    (0.5475 0.025 0)
    (0.5525 0.025 0)
    (0.5575 0.025 0)
    (0.5625 0.025 0)
    (0.5675 0.025 0)
    (0.5725 0.025 0)
    (0.5775 0.025 0)
    (0.5825 0.025 0)
    (0.5875 0.025 0)
    (0.5925 0.025 0)
    (0.5975 0.025 0)
    (0.6025 0.025 0)
    (0.6075 0.025 0)
    (0.6125 0.025 0)
    (0.6175 0.025 0)
    (0.6225 0.025 0)
    (0.6275 0.025 0)
    (0.6325 0.025 0)
    (0.6375 0.025 0)
    (0.6425 0.025 0)
    (0.6475 0.025 0)
    (0.6525 0.025 0)
    (0.6575 0.025 0)
    (0.6625 0.025 0)
    (0.6675 0.025 0)
    (0.6725 0.025 0)
    (0.6775 0.025 0)
    (0.6825 0.025 0)
    (0.6875 0.025 0)
    (0.6925 0.025 0)
    (0.6975 0.025 0)
    (0.7025 0.025 0)
    (0.7075 0.025 0)
    (0.7125 0.025 0)
    (0.7175 0.025 0)
    (0.7225 0.025 0)
    (0.7275 0.025 0)
    (0.7325 0.025 0)
    (0.7375 0.025 0)
    (0.7425 0.025 0)
    (0.7475 0.025 0)
    (0.7525 0.025 0)
    (0.7575 0.025 0)
    (0.7625 0.025 0)
    (0.7675 0.025 0)
    (0.7725 0.025 0)
    (0.7775 0.025 0)
    (0.7825 0.025 0)
    (0.7875 0.025 0)
    (0.7925 0.025 0)
    (0.7975 0.025 0)
    (0.8025 0.025 0)
    (0.8075 0.025 0)
    (0.8125 0.025 0)
    (0.8175 0.025 0)
    (0.8225 0.025 0)
    (0.8275 0.025 0)
    (0.8325 0.025 0)
    (0.8375 0.025 0)
    (0.8425 0.025 0)
    (0.8475 0.025 0)
    (0.8525 0.025 0)
    (0.8575 0.025 0)
    (0.8625 0.025 0)
    (0.8675 0.025 0)
    (0.8725 0.025 0)
    (0.8775 0.025 0)
    (0.8825 0.025 0)
    (0.8875 0.025 0)
    (0.8925 0.025 0)
    (0.8975 0.025 0)
    (0.9025 0.025 0)
    (0.9075 0.025 0)
    (0.9125 0.025 0)
    (0.9175 0.025 0)
    (0.9225 0.025 0)
    (0.9275 0.025 0)
    (0.9325 0.025 0)
    (0.9375 0.025 0)
    (0.9425 0.025 0)
    (0.9475 0.025 0)
    (0.9525 0.025 0)
    (0.9575 0.025 0)
    (0.9625 0.025 0)
    (0.9675 0.025 0)
    (0.9725 0.025 0)
    (0.9775 0.025 0)
    (0.9825 0.025 0)
    (0.9875 0.025 0)
    (0.9925 0.025 0)
    (0.9975 0.025 0)
);

