reference/openfoam/compressible_acoustic_box/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

readFields      ( p );

_p_init
{
    // p(x) = p0 * (1 + eps * cos(pi * x / L))
    // For this case p0=1 and L=1.
    variables   ( "eps=1e-3" );
    expression  #{ 1.0*(1.0 + eps*cos(3.141592653589793*pos().x()/1.0)) #};
    dimensions  [1 -1 -2 0 0 0 0];
}

expressions
(
    p
    {
        field   p;
        create  no;
        $_p_init;
    }
);
